# RunName Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SetupEnergySimulationDialog..::..RunName Property
SetupEnergySimulationDialog Class See Also
---
The name of the analysis run that was supplied by the user.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string RunName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RunName As String
	Get
```

Visual C++
---
```text
public:
property String^ RunName {
	String^ get ();
}
```

# Remarks
This value is only valid after Show()()()() has been called.
# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace